app/controllers/stats_controller.rb

SELECT COUNT(*) FROM "posts"
SELECT COUNT(*) FROM "authors"
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" DESC LIMIT 1
---
  def index
    #lab notes this, not sure if it means change it to blank or leave it
    @post_count = Post.count
    @authors_count = Author.count
    @last_post = Post.last